Repository: redDwarf03/did_app
Catalog: lib/l10n/app_*.arb
Languages: fr

# didWalletTitle
source: DID Wallet
fr: Portefeuille DID

# didWalletSubtitle
source: Your digital identity wallet
fr: Votre portefeuille d'identité numérique

# credentialDetailTitle
source: Credential Details
fr: Détails du Credential

source: Credential Type
fr: Type d'attestation

source: Issuer
fr: Émetteur

source: Issuance Date
fr: Date d'émission

source: Expiration Date
fr: Date d'expiration

source: No credentials
fr: Aucun credential trouvé.

# eidasInteropTitle
source: eIDAS 2.0 & EUDI Wallet
fr: Interopérabilité eIDAS

# eidasInteropDescription
source: This screen allows you to import and export credentials in eIDAS 2.0 format, compatible with European digital identity regulations.
fr: Interagir avec les services eIDAS pour l'identification et la confiance transfrontalières.

# eidasTrustRegistryTitle
source: eIDAS Trust Registry
fr: Registre de confiance eIDAS

# eidasTrustRegistryDescription
source: The eIDAS Trust Registry is the official list of services authorized to issue digital credentials in the European Union. It allows you to verify if an issuer is legitimate before accepting their credentials.
fr: Afficher et gérer les entités de confiance dans le cadre eIDAS.

# eidasLevelLow
source: eIDAS LoA Low
fr: Niveau eIDAS Bas

# eidasLevelSubstantial
source: eIDAS LoA Substantial
fr: Niveau eIDAS Substantiel

# eidasLevelHigh
source: eIDAS LoA High
fr: eIDAS LoA Élevé

# requestCredentialButton
source: Request a credential
fr: Demander le Credential

source: Verification Result
fr: Résultat de la vérification

# documentDetailTitle
source: Document Details
fr: Détails du document

# editDocumentTitle
source: Edit Document
fr: Modifier le document

# documentVersionsTitle
source: Document Versions
fr: Versions du document

# selectFile
source: Select a file
fr: Sélectionner un fichier

# documentDownloadUnexpectedError
source: An unexpected error occurred while downloading the document: {error}
fr: Une erreur inattendue s'est produite lors du téléchargement du document : {error}

# sharedDocumentsTitle
source: Shared With Me
fr: Documents Partagés

# navHome
source: Home
fr: Accueil

# navIdentity
source: Identity
fr: Identité

# navCredentials
source: Credentials
fr: Attestations

# navVerification
source: Verification
fr: Vérification

# documentNotFoundTitle
source: Document not found
fr: Document non trouvé

# documentVersionsErrorLoading
source: Error loading document versions: {error}
fr: Erreur lors du chargement des versions du document : {error}

# compareVersionsDialogTitle
source: Compare Versions
fr: Comparer les versions

# compareVersionsFeatureNotAvailable
source: Version comparison feature is not available yet
fr: La fonctionnalité de comparaison des versions n'est pas encore disponible

# closeButton
source: Close
fr: Fermer

# compareVersionsAction
source: Compare Versions
fr: Comparer les versions

# refreshAction
source: Refresh
fr: Actualiser

# noVersionHistory
source: No version history available
fr: Aucun historique de versions disponible

# versionHistoryTitle
source: Version History ({count})
fr: Historique des versions ({count})

# createdOnLabel
source: Created on {date}
fr: Créé le {date}

# downloadVersionButton
source: Download Version
fr: Télécharger la version

# changeNotesLabel
source: Change Notes
fr: Notes de modification

# documentPreviewLabel
source: Document Preview
fr: Aperçu du document

# documentPreviewNotAvailableVersions
source: Preview not available for this version
fr: Aperçu non disponible pour cette version

# downloadToViewInstructions
source: Download the version to view its content
fr: Téléchargez la version pour voir son contenu

# technicalDetailsLabel
source: Technical Details
fr: Détails techniques

# versionIdLabel
source: Version ID
fr: ID de version

# documentHashLabelDetail
source: Document Hash
fr: Hachage du document

# storagePathLabel
source: Storage Path
fr: Chemin de stockage

# blockchainTxLabelDetail
source: Blockchain Transaction
fr: Transaction blockchain

# downloadingVersionDialog
source: Downloading version...
fr: Téléchargement de la version...

# downloadSuccessMessage
source: Version {version} downloaded successfully ({size} KB)
fr: Version {version} téléchargée avec succès ({size} Ko)

# identityErrorTitle
source: Identity Error
fr: Erreur d'identité

source: Verification Error
fr: Erreur de vérification

# retryButtonVerification
source: Retry
fr: Réessayer

# identityVerificationTitle
source: Identity Verification
fr: Vérification d'identité

# goBackButton
source: Go Back
fr: Retour

# verifyYourIdentityTitle
source: Verify Your Identity
fr: Vérifiez votre identité

# verifyYourIdentityDescription
source: Complete the verification process to access all features of your digital identity wallet.
fr: Complétez le processus de vérification pour accéder à toutes les fonctionnalités de votre portefeuille d'identité numérique.

# verificationStepEmailPhone
source: Email & Phone Verification
fr: Vérification email et téléphone

# verificationStepIdDocument
source: ID Document Verification
fr: Vérification du document d'identité

# verificationStepAddressProof
source: Address Proof Verification
fr: Vérification de la preuve d'adresse

# verificationStepLiveness
source: Liveness Check
fr: Vérification de présence

# startVerificationButtonMain
source: Start Verification
fr: Commencer la vérification

# verificationProcessHelpTooltip
source: Help with verification process
fr: Aide sur le processus de vérification

# certificateIdLabel
source: Certificate ID
fr: ID du certificat

# signatureAuthenticityInfo
source: This digital signature proves the authenticity of the certificate
fr: Cette signature numérique prouve l'authenticité du certificat

# copySignatureTooltip
source: Copy signature
fr: Copier la signature

# verificationCompleteTitle
source: Verification Complete
fr: Vérification terminée

# verificationSuccessTitle
source: Verification Successful!
fr: Vérification réussie !

# verificationSuccessDescription
source: Your identity has been successfully verified and is now compliant with KYC/AML regulations and eIDAS 2.0 standards.
fr: Votre identité a été vérifiée avec succès et est maintenant conforme aux réglementations KYC/AML et aux normes eIDAS 2.0.

# returnToHomeButton
source: Return to Home
fr: Retour à l'accueil

# viewMyIdentityButton
source: View My Identity
fr: Voir mon identité

# shareCertificateButton
source: Share Certificate
fr: Partager le certificat

# verificationCertificateTitle
source: Verification Certificate
fr: Certificat de vérification

# issuedDateLabel
source: Issue Date
fr: Date d'émission

# expiryDateLabel
source: Expiry Date
fr: Date d'expiration

# issuerLabel
source: Issuer
fr: Émetteur

# eidasLevelLabel
source: eIDAS Level
fr: Niveau eIDAS

# copyToClipboardTooltip
source: Copy to clipboard
fr: Copier dans le presse-papiers

source: eIDAS Compliant Level
fr: Niveau de conformité eIDAS

# copiedToClipboardMessage
source: Copied to clipboard
fr: Copié dans le presse-papiers

# shareCertificateDialogTitle
source: Share Certificate
fr: Partager le certificat

# shareCertificateDialogContent
source: Share your verification certificate with others
fr: Partagez votre certificat de vérification avec d'autres

# eidasLevelLowDescription
source: Basic level of assurance suitable for low-risk transactions
fr: Niveau de garantie basique adapté aux transactions à faible risque

# eidasLevelSubstantialDescription
source: Higher level of assurance suitable for most transactions
fr: Niveau de garantie élevé adapté à la plupart des transactions

# eidasLevelHighDescription
source: Highest level of assurance required for sensitive transactions
fr: Niveau de garantie le plus élevé requis pour les transactions sensibles

# eidasCompliantLevelDisplay
source: eIDAS Compliant Level
fr: Niveau de conformité eIDAS

# emailVerificationTitle
source: Email Verification
fr: Vérification de l'email

# emailVerificationDescription
source: We need to verify your email address to proceed with the identity verification process.
fr: Nous devons vérifier votre adresse email pour poursuivre le processus de vérification d'identité.

# emailToVerifyLabel
source: Email to verify
fr: Email à vérifier

# sendVerificationCodeButton
source: Send verification code
fr: Envoyer le code de vérification

# sendingVerificationCodeButton
source: Sending verification code...
fr: Envoi du code de vérification...

# enterVerificationCodePrompt
source: Enter the 6-digit verification code sent to {email}
fr: Entrez le code de vérification à 6 chiffres envoyé à {email}

# demoVerificationCodeMessage
source: Demo: Your verification code is {code}
fr: Démo : Votre code de vérification est {code}

# verificationCodeLabel
source: Verification Code
fr: Code de vérification

# verificationCodeHint
source: 6-digit code
fr: Code à 6 chiffres

# verificationCodeRequired
source: Please enter the verification code
fr: Veuillez entrer le code de vérification

# phoneVerificationTitle
source: Phone Verification
fr: Vérification du téléphone

# phoneVerificationDescription
source: We need to verify your phone number to proceed with the identity verification process.
fr: Nous devons vérifier votre numéro de téléphone pour poursuivre le processus de vérification d'identité.

# sendingButton
source: Sending...
fr: Envoi en cours...

# sendVerificationCodeSmsButton
source: Send verification code
fr: Envoyer le code de vérification

# sendingCodeButton
source: Sending code...
fr: Envoi du code...

# changePhoneNumberButton
source: Change phone number
fr: Changer le numéro de téléphone

# enterPhoneVerificationCodePrompt
source: Enter the 6-digit verification code sent to {phoneNumber}
fr: Entrez le code de vérification à 6 chiffres envoyé au {phoneNumber}

# demoPhoneVerificationCodeMessage
source: Demo: Your verification code is {code}
fr: Démo : Votre code de vérification est {code}

# uploadDocumentTitle
source: Upload {documentType}
fr: Téléverser {documentType}

# takePhotoButton
source: Take Photo
fr: Prendre une photo

# uploadFileButton
source: Upload File
fr: Téléverser un fichier

# documentRequirementsTitle
source: Make sure your documents are:
fr: Assurez-vous que vos documents sont :

# documentRequirementClear
source: Clear and readable
fr: Clairs et lisibles

# documentRequirementCorners
source: Showing all 4 corners
fr: Montrant les 4 coins

# documentRequirementExpiry
source: Not expired
fr: Non expirés

# documentRequirementGlare
source: Without glare or shadows
fr: Sans reflets ni ombres

# uploadedDocumentsTitle
source: Uploaded Documents
fr: Documents téléversés

# submittingButton
source: Submitting...
fr: Envoi en cours...

# submitDocumentsButton
source: Submit Documents
fr: Soumettre les documents

source: Revocation Management
fr: Gestion des révocations

source: Credential Status
fr: Statut de l'attestation

source: Credential Revoked
fr: Attestation révoquée

source: Credential Valid
fr: Attestation valide

source: Credential ID
fr: Identifiant de l'attestation

source: Revoke Credential
fr: Révoquer l'attestation

# unrevokeCredential
source: Cancel Revocation
fr: Annuler la révocation

source: Revocation Reason
fr: Raison de la révocation

# revocationDetails
source: Additional Details
fr: Détails supplémentaires

# revocationDetailsHint
source: Specify reasons for revocation...
fr: Précisez les raisons de la révocation...

# unrevocationReason
source: Reason for Cancellation
fr: Raison de l'annulation

# unrevocationReasonHint
source: Specify reasons for cancelling the revocation...
fr: Précisez les raisons de l'annulation de la révocation...

# revocationWarning
source: Warning: Revoking a credential is a significant action that may affect the validity of this document.
fr: Attention: La révocation d'une attestation est une action importante qui peut affecter la validité de ce document.

# syncRevocationStatus
source: Sync Status
fr: Synchroniser le statut

source: Revocation History
fr: Historique des révocations

# noRevocationHistory
source: No revocation history available
fr: Aucun historique de révocation disponible

# credentialUnrevoked
source: Revocation Cancelled
fr: Révocation annulée

source: Reason
fr: Raison

source: Details
fr: Détails

# revocationSuccess
source: The credential has been successfully revoked
fr: L'attestation a été révoquée avec succès

# unrevocationSuccess
source: The revocation has been successfully cancelled
fr: La révocation a été annulée avec succès

# revocationReasonCompromised
source: Credential compromised
fr: Attestation compromise

# revocationReasonSuperseded
source: Credential superseded
fr: Attestation remplacée

# revocationReasonNoLongerValid
source: Credential no longer valid
fr: Attestation plus valide

# revocationReasonIssuerRevoked
source: Revoked by issuer
fr: Révoquée par l'émetteur

# revocationReasonOther
source: Other reason
fr: Autre raison

# manageRevocationButton
source: Manage Revocation
fr: Gérer la révocation

# statusListDashboardTitle
source: Status List Dashboard
fr: Tableau de Bord des Listes de Statut

# statusListDescription
source: Status List 2021 is a W3C standard for managing credential revocation status
fr: La Liste de Statut 2021 est une norme W3C pour la gestion du statut de révocation des attestations

# statusListVerifyButton
source: Verify Status
fr: Vérifier le Statut

# statusListNoCache
source: No status lists cached
fr: Aucune liste de statut en cache

# statusListHowItWorks
source: How it works
fr: Comment ça fonctionne

# statusListHowItWorksContent
source: Status lists are cryptographically secure bitstrings that efficiently track credential revocation status
fr: Les listes de statut sont des chaînes de bits cryptographiquement sécurisées qui suivent efficacement le statut de révocation des attestations

# statusList2021Title
source: Status List 2021
fr: Liste de Statut 2021

# verificationStatusNotStarted
source: Not Started
fr: Non commencé

# verificationStatusInProgress
source: In Progress
fr: En cours

# verificationStatusPendingReview
source: Pending Review
fr: En attente de vérification

# verificationStatusCompleted
source: Completed
fr: Terminé

# verificationStatusFailed
source: Failed
fr: Échoué

# verificationStatusCancelled
source: Cancelled
fr: Annulé

# verificationStatusPending
source: Pending
fr: En attente

# verificationStatusExpired
source: Expired
fr: Expiré

# verificationStatusRejected
source: Rejected
fr: Rejeté

# verificationStatusActionRequired
source: Action Required
fr: Action requise

# verificationStatusNotStartedDescription
source: Verification has not started yet.
fr: La vérification n'a pas encore commencé.

# verificationStatusInProgressDescription
source: Verification is in progress.
fr: La vérification est en cours.

# verificationStatusPendingReviewDescription
source: Your submission is pending review.
fr: Votre soumission est en attente de vérification.

# verificationStatusCompletedDescription
source: Verification is complete.
fr: La vérification est terminée.

# verificationStatusFailedDescription
source: Verification failed.
fr: La vérification a échoué.

# verificationStatusCancelledDescription
source: Verification was cancelled.
fr: La vérification a été annulée.

# verificationStatusExpiredDescription
source: Verification has expired.
fr: La vérification a expiré.

# verificationStatusRejectedDescription
source: Verification was rejected.
fr: La vérification a été rejetée.

# verificationStepEmailVerification
source: Email Verification
fr: Vérification de l'email

# verificationStepPhoneVerification
source: Phone Verification
fr: Vérification du téléphone

# verificationStepIdDocumentVerification
source: ID Document Verification
fr: Vérification du document d'identité

# verificationStepAddressVerification
source: Address Verification
fr: Vérification de la preuve d'adresse

# verificationStepLivenessCheck
source: Liveness Check
fr: Vérification de présence

# verificationStepBiometricVerification
source: Biometric Verification
fr: Vérification biométrique

# verificationStepAdditionalDocuments
source: Additional Documents
fr: Documents supplémentaires

# verificationStepPayment
source: Payment
fr: Paiement

# verificationStepReview
source: Review
fr: Revue

# verificationStepSelfieCapture
source: Selfie Capture
fr: Capture de selfie

# verificationStepIdentityVerification
source: Identity Verification
fr: Vérification d'identité

# verificationStepDocumentUpload
source: Document Upload
fr: Téléverser un document

# stepStatusNotStarted
source: Not Started
fr: Non commencé

# stepStatusInProgress
source: In Progress
fr: En cours

# stepStatusCompleted
source: Completed
fr: Terminé

# stepStatusRejected
source: Rejected
fr: Rejeté

# stepStatusActionRequired
source: Action Required
fr: Action requise

# errorOccurred
source: Error
fr: Une erreur est survenue: {error}

# cancelButton
source: Cancel
fr: Annuler

# verificationResultTitle
source: Verification result
fr: Résultat de la vérification

# credentialReceivedMessage
source: Congratulations! You have received a new credential
fr: Félicitations ! Vous avez reçu une nouvelle attestation.
